#include "melody.h"

// Мобильник (из Бумера)
const _melody_t melody00 = {
  180, {
    8,	E|O2,		16,	G|O2,		16,	P|O2,		8,	G|O2,		16,	E|O2,		16,	P|O2,		8,	A|O2,		8,	G|O2,
    8,	A|O2,		8,	G|O2,		8,	A|O2,		8,	G|O2,		8,	A|O2,		8,	G|O2,		8,	A|O2,		16,	B|O2,
    0,  0
  }
};

// Белые розы
const _melody_t melody01 = {
  120, {
    8,	B|O1,		8,	B|O1,		8,	B|O1,		16,	B|O1,		16,	F_|O1,	8,	P|O2,		8,	B|O1,		8,	B|O1,
    8,	B|O1,		16,	B|O1,		16,	F_|O1,	8,	P|O2,		16,	B|O1,		16,	G|O1,		8,	F_|O1,	8,	G|O1,
    8,	F_|O1,	16,	G|O1,		8,	P|O2,		8,	P|O2,		8,	P|O2,		8,	A|O1,		8,	A|O1,		8,	A|O1,
    16,	A|O1,		16,	E|O1,		8,	P|O2,		8,	A|O1,		8,	A|O1,		8,	A|O1,		16,	A|O1,		16,	E|O1,
    8,	P|O2,		16,	A|O1,		16,	F|O1,		8,	E|O1,		8,	F|O1,		8,	E|O1,		16,	F|O1,   0,  0
  }
};

// ДДТ: Оcень
const _melody_t melody02 = {
  120, {
    8,	E|O2,		4,	C|O2,		12,	B|O1,		8,	A|O1,		12,	E|O2,		12,	B|O1,		4,	B|O1,		8,	C|O2,
    12,	B|O1,		48,	A|O1,		8,	A|O1,		4,	A|O1,		12,	A|O1,		8,	A|O1,		12,	A|O1,		8,	A|O1,
    4,	C_|O2,	12,	E|O2,		12,	G|O2,		48,	F|O2,		12,	D|O2,		4,	D|O2,		8,	D|O2,		8,	D|O2,
    8,	G|O2,		8,	F|O2,		12,	E|O2,		12,	D|O2,		8,	E|O2,		8,	E|O2,		4,	E|O2,		8,	D|O2,
    12,	C|O2,		16,	A|O1,		8,	P|O2,		8,	B|O1,		8,	B|O1,		8,	G|O2,		8,	F|O2,		8,	E|O1,
    4,	E|O1,		8,	E|O2,		12,	C|O2,		12,	B|O1,		32,	A|O1,   0,  0
  }
};

// Europe: Final countdown
const _melody_t melody03 = {
  120, {
    4,	C|O2,		4,	A_|O1,	16,	C|O2,		32,	F|O1,		4,	C_|O2,	4,	C|O2,		8,	C_|O2,	8,	C|O2,
    32,	A_|O1,	4,	C_|O2,	4,	C|O2,		16,	C_|O2,	32,	F|O1,		4,	A_|O1,	4,	G_|O1,	8,	A_|O1,
    8,	G_|O1,	8,	G|O1,		8,	A_|O1,	32,	G_|O1,	4,	G|O1,		4,	G_|O1,	32,	A_|O1,	4,	G_|O1,
    4,	A_|O1,	8,	C|O2,		8,	A_|O1,	8,	G_|O1,	8,	G|O1,		16,	F|O1,		16,	C_|O2,	64,	C|O2,
    4,	C|O2,		4,	C_|O2,	4,	C|O2,		4,	A_|O1,	64,	C|O2,   0,  0
  }
};

// AQUA
const _melody_t melody04 = {
  120, {
    8,	G_|O2,	8,	E|O2,		8,	G_|O2,	8,	C_|O3,	16,	A|O2,		16,	P|O2,		8,	F_|O2,	8,	D_|O2,
    8,	F_|O2,	8,	B|O2,		16,	G_|O2,	8,	F_|O2,	8,	E|O2,		16,	P|O2,		8,	E|O2,		8,	C_|O2,
    16,	F_|O2,	16,	C_|O2,	16,	P|O2,		8,	F_|O2,	8,	E|O2,		16,	G_|O2,	16,	F_|O2,  0,  0
  }
};

// ABBA: MoneyMoney
const _melody_t melody05 = {
  120, {
    8,	E|O3,		8,	E|O3,		8,	E|O3,		8,	E|O3,		8,	E|O3,		8,	E|O3,		4,	E|O2,		4,	A|O2,
    4,	C|O3,		4,	E|O3,		8,	D_|O3,	8,	D_|O3,	8,	D_|O3,	8,	D_|O3,	8,	D_|O3,	8,	D_|O3,
    4,	F|O2,		4,	A|O2,		4,	C|O3,		4,	D_|O3,	16,	D|O3,		8,	C|O3,		8,	A|O2,		8,	C|O3,
    16,	C|O3,		32,	A|O2,		2,	A|O2,		2,	C|O3,		2,	E|O3,		8,	A|O3,   0,  0
  }
};

// Star Wars
const _melody_t melody06 = {
  110, {
    8,	C_|O1,	8,	C_|O1,	4,	C_|O1,	32,	F_|O1,	32,	C_|O2,	8,	B|O1,		4,	A_|O1,	8,	G_|O1,
    32,	F_|O2,	16,	C_|O2,	8,	B|O1,		4,	A_|O1,	8,	G_|O1,	32,	F_|O2,	16,	C_|O2,	8,	B|O1,
    4,	A_|O1,  8,	B|O1,		32,	G_|O1,  8,	C_|O1,	8,	C_|O1,	4,	C_|O1,	32,	F_|O1,	32,	C_|O2,
    8,	B|O1,		4,	A_|O1,	8,	G_|O1,	32,	F_|O2,	16,	C_|O2,	8,	B|O1,		4,	A_|O1,	8,	G_|O1,
    32,	F_|O2,	16,	C_|O2,	8,	B|O1,		4,	A_|O1,	8,	B|O1,		32,	G_|O1,	16,	C_|O1,	4,	C_|O1,
    32,	D_|O1,	8,	C_|O2,	8,	B|O1,		8,	A_|O1,	8,	G_|O1,	8,	F_|O1,	4,	F_|O1,	8,	G_|O1,
    4,	A_|O1,	16,	G_|O1,  0,  0
  }
};

// Mission Imposible
const _melody_t melody07 = {
  120, {
    2,	E|O2,		2,	F|O2,		2,	E|O2,		2,	F|O2,		2,	E|O2,		2,	F|O2,		2,	E|O2,		2,	F|O2,
    2,	E|O2,		2,	F|O2,		2,	E|O2,		2,	F|O2,		2,	E|O2,		2,	F|O2,		2,	E|O2,		2,	F|O2,
    4,	G|O2,		8,	P|O2,		4,	G|O2,		8,	P|O2,		4,	F|O2,		4,	P|O2,		4,	F_|O2,	4,	P|O2,
    4,	G|O2,		8,	P|O2,		4,	G|O2,		8,	P|O2,		4,	A_|O2,	4,	P|O2,		4,	C|O3,		4,	P|O2,
    4,	A_|O2,	4,	G|O2,		32,	D|O2,		2,	P|O2,		4,	A_|O2,	4,	G|O2,		32,	C_|O2,	2,	P|O2,
    4,	A_|O2,	4,	G|O2,		32,	C|O2,		4,	P|O2,		4,	A_|O1,	4,	C|O2,   0,  0
  }
};

// Frog (Croak)
const _melody_t melody08 = {
	120, {
		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		
		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		32,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,		
		2,	P|O2,		2,	A_|O3,	2,	P|O2,	  2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,		
		2,	P|O2,		32,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,	  2,	A_|O3,	2,	P|O2,		
		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		64,	P|O2,		64,	P|O2,		
		16,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,		
		2,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		32,	P|O2,		2,	A_|O3,	2,	P|O2,		
		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		
		2,	A_|O3,	2,	P|O2,		32,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,		
		2,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		2,	A_|O3,	2,	P|O2,		64,	P|O2,		
		64,	P|O2,		0,  0
	}
};

// Mozart 40
const _melody_t melody09 = {
	240, {
		8,	A|O2,		4,	G_|O2,	4,	P|O2,		8,	G_|O2,	8,	P|O2,		8,	A|O2,		4,	G_|O2,	4,	P|O2,		
		8,	G_|O2,	8,	P|O2,		8,	A|O2,		4,	G_|O2,	4,	P|O2,		16,	G_|O2,	12,	E|O3,		16,	P|O2,		
		4,	P|O2,		8,	E|O3,		4,	D_|O3,	4,	P|O2,		8,	C_|O3,	8,	P|O2,		8,	C_|O3,	4,	B|O2,		
		4,	P|O2,		8,	A|O2,		8,	P|O2,		6,	A|O2,		2,	P|O2,		4,	G_|O2,	4,	P|O2,		8,	F_|O2,		
		8,	P|O2,		8,	F_|O2,	16,	P|O2,		8,	P|O2,		6,	G_|O2,	2,	P|O2,		6,	F_|O2,	2,	P|O2,		
		8,	F_|O2,	8,	P|O2,		8,	G_|O2,	4,	F_|O2,	4,	P|O2,		8,	F_|O2,	8,	P|O2,		8,	G_|O2,		
		4,	F_|O2,	4,	P|O2,		16,	F_|O2,	8,	D_|O3,	16,	P|O2,		8,	P|O2,		8,	D_|O3,	8,	C_|O3,		
		8,	C|O3,		8,	P|O2,		8,	C|O3,		8,	A|O2,		6,	G_|O2,	8,	P|O2,		2,	P|O2,		8,	G_|O2,		
		8,	F_|O2,	8,	E|O2,		8,	P|O2,		8,	E|O2,		16,	P|O2,		8,	P|O2,		8,	E|O3,		4,	D_|O3,		
		4,	P|O2,		16,	D_|O3,	16,	F_|O3,	16,	C|O3,		16,	D_|O3,	16,	C_|O3,	16,	G_|O2,	16,	P|O2,		
		6,	E|O3,		2,	P|O2,		4,	D_|O3,	4,	P|O2,		16,	D_|O3,	16,	F_|O3,	16,	C|O3,		16,	D_|O3,		
		16,	C_|O3,	16,	E|O3,		8,	D_|O3,	8,	C_|O3,	8,	B|O2,		8,	A|O2,		64,	G_|O2,	64,	G|O2,		
		32,	G_|O2,	16,	P|O2,		4,	G_|O1,	4,	P|O2,		4,	G_|O1,	4,	P|O2,		32,	G_|O1,	16,	P|O2,		
		4,	G_|O1,	4,	P|O2,		4,	G_|O1,	4,	P|O2,		32,	G_|O1,	16,	P|O2,		4,	G_|O1,	4,	P|O2,		
		4,	G_|O1,	4,	P|O2,		8,	G_|O1,	8,	P|O2,		4,	G_|O1,	4,	P|O2,		4,	G_|O1,	4,	P|O2,		
		8,	G_|O1,	8,	P|O2,		4,	G_|O1,	4,	P|O2,		4,	G_|O1,	4,	P|O2,		32,	G_|O1,	0,  0
	}
};

// Toreador
const _melody_t melody10 = {
	180, {
		16,	C|O3,		12,	D|O3,		4,	C|O3,		16,	A|O2,		16,	A|O2,		8,	A|O2,		4,	P|O2,		4,	G|O2,		
		12,	A|O2,		4,	A_|O2,	16,	A|O2,		16,	P|O2,		16,	A_|O2,	12,	G|O2,		4,	C|O3,		16,	A|O2,		
		16,	P|O2,		16,	F|O2,		12,	D|O2,		4,	G|O2,		16,	C|O2,		16,	P|O2,		32,	G|O2,		8,	G|O2,		
		8,	D|O3,		8,	C|O3,		8,	A_|O2,	6,	A|O2,		2,	P|O2,		8,	G|O2,		8,	A|O2,		8,	A_|O2,		
		16,	A|O2,		16,	P|O2,		16,	E|O2,		16,	A|O2,		16,	A|O2,		8,	G_|O2,	8,	B|O2,		64,	E|O3,		
		8,	P|O2,		2,	D|O3,		4,	E|O3,		2,	D|O3,		8,	C_|O3,	8,	D|O3,		8,	G|O2,		8,	A|O2,		
		16,	A_|O2,	8,	P|O2,		2,	A|O2,		4,	A_|O2,	2,	A|O2,		8,	F|O2,		8,	D|O3,		24,	C|O3,		
		16,	P|O2,		2,	F|O2,		4,	G|O2,		2,	F|O2,		8,	C|O2,		8,	A_|O2,	8,	A|O2,		8,	P|O2,		
		8,	G|O2,		8,	P|O2,		8,	F|O2,		32,	P|O2,		0,  0
	}
};

// Merry Xmas
const _melody_t melody11 = {
	160, {
		16,	D|O1,		16,	G|O1,		8,	G|O1,		8,	A|O1,		8,	G|O1,		8,	F_|O1,	16,	E|O1,		16,	C|O1,		
		16,	E|O1,		16,	A|O1,		8,	A|O1,		8,	B|O1,		8,	A|O1,		8,	G|O1,		16,	F_|O1,	16,	D|O1,		
		16,	D|O1,		16,	B|O1,		8,	B|O1,		8,	C|O2,		8,	B|O1,		8,	A|O1,		16,	G|O1,		16,	E|O1,		
		8,	D|O1,		8,	D|O1,		16,	E|O1,		16,	A|O1,		16,	F_|O1,	32,	G|O1,		0,  0
	}
};

// Гимн СССР
const _melody_t melody12 = {
	90, {
		8,	G|O1,		16,	C|O2,		12,	G|O1,		4,	A|O1,		16,	B|O1,		8,	E|O1,		8,	E|O1,		16,	A|O1,		
		12,	G|O1,		4,	F|O1,		16,	G|O1,		8,	C|O1,		8,	C|O1,		16,	D|O1,		8,	D|O1,		8,	E|O1,		
		16,	F|O1,		8,	F|O1,		8,	G|O1,		16,	A|O1,		8,	B|O1,		8,	C|O2,		16,	D|O2,		8,	P|O2,		
		8,	G|O1,		16,	E|O2,		12,	D|O2,		4,	C|O2,		16,	D|O2,		8,	B|O1,		8,	G|O1,		16,	C|O2,		
		12,	B|O1,		4,	A|O1,		16,	B|O1,		8,	E|O1,		8,	E|O1,		16,	A|O1,		8,	G|O1,		8,	F|O1,		
		16,	G|O1,		8,	C|O1,		8,	C|O1,		16,	C|O2,		12,	B|O1,		4,	A|O1,		16,	G|O1,		0,  0
	}
};

// Агата Кристи: Я на тебе, как на войне
const _melody_t melody13 = {
	170, {
		8,	D|O1,		16,	D|O2,		16,	A_|O1,	16,	A|O1,		8,	F|O1,		16,	F|O2,		16,	D_|O2,	16,	D|O2,		
		8,	P|O2,		8,	C|O2,		8,	A_|O1,	16,	C|O2,		16,	A|O1,		8,	P|O2,		8,	A|O1,		16,	A_|O1,		
		16,	A|O1,		16,	G|O1,		8,	D|O1,		16,	D|O2,		16,	A_|O1,	16,	A|O1,		8,	F|O1,		16,	F|O2,		
		16,	D_|O2,	16,	D|O2,		8,	P|O2,		8,	C|O2,		8,	A_|O1,	16,	C|O2,		32,	D|O2,		32,	F_|O2,		
		32,	G|O2,		0,  0
	}
};

// Александра (к/ф Москва слезам не верит)
const _melody_t melody14 = {
	120, {
		8,	D|O2,		8,	C_|O2,	16,	B|O1,		8,	F_|O1,	8,	P|O1,		8,	A|O1,		8,	G|O1,		16,	F_|O1,		
		8,	E|O1,		8,	P|O1,		8,	E|O1,		8,	E|O1,		16,	B|O1,		8,	B|O1,		16,	A|O1,		8,	G|O1,		
		16,	G|O1,		8,	F_|O1,	8,	P|O1,		8,	B|O1,		8,	F_|O2,	16,	F_|O2,	8,	E|O2,		8,	P|O1,		
		8,	F_|O2,	8,	E|O2,		16,	E|O2,		8,	D|O2,		8,	P|O1,		8,	F_|O1,	8,	D|O2,		16,	D|O2,		
		8,	C_|O2,	16,	F_|O1,	8,	C_|O2,	16,	B|O1,		0,  0
	}
};

// ДДТ: Дождь
const _melody_t melody15 = {
	160, {
		16,	E|O2,		32,	P|O2,		4,	E|O2,		4,	P|O2,		4,	E|O2,		4,	P|O2,		4,	E|O2,		4,	P|O2,		
		4,	E|O2,		4,	P|O2,		16,	E|O2,		16,	D|O2,		16,	F|O2,		8,	E|O2,		16,	E|O2,		4,	P|O2,		
		8,	D|O2,		8,	F|O2,		16,	E|O2,		16,	C|O2,		16,	P|O2,		8,	A|O1,		8,	B|O1,		8,	C|O2,		
		8,	D|O2,		16,	E|O2,		4,	P|O2,		16,	E|O2,		4,	E|O2,		4,	P|O2,		4,	E|O2,		4,	P|O2,		
		4,	E|O2,		4,	P|O2,		8,	E|O2,		8,	D|O2,		16,	P|O2,		16,	F|O2,		8,	E|O2,		16,	E|O2,		
		8,	D|O2,		16,	C|O2,		8,	B|O1,		16,	C|O2,		4,	P|O2,		0,  0
	}
};

// ДДТ: Осень
const _melody_t melody16 = {
	120, {
		8,	E|O2,		4,	C|O2,		12,	B|O1,		8,	A|O1,		12,	E|O2,		12,	B|O1,		4,	B|O1,		8,	C|O2,		
		12,	B|O1,		48,	A|O1,		8,	A|O1,		4,	A|O1,		12,	A|O1,		8,	A|O1,		12,	A|O1,		8,	A|O1,		
		4,	C_|O2,	12,	E|O2,		12,	G|O2,		48,	F|O2,		12,	D|O2,		4,	D|O2,		8,	D|O2,		8,	D|O2,		
		8,	G|O2,		8,	F|O2,		12,	E|O2,		12,	D|O2,		8,	E|O2,		8,	E|O2,		4,	E|O2,		8,	D|O2,		
		12,	C|O2,		16,	A|O1,		8,	P|O2,		8,	B|O1,		8,	B|O1,		8,	G|O2,		8,	F|O2,		8,	E|O1,		
		4,	E|O1,		8,	E|O2,		12,	C|O2,		12,	B|O1,		32,	A|O1,		0,  0
	}
};

// Дюна: Если б море было...
const _melody_t melody17 = {
	120, {
		16,	E|O3,		8,	P|O2,		8,	E|O3,		8,	E|O3,		8,	E|O3,		8,	D|O3,		8,	E|O3,		8,	D|O3,		
		32,	C|O3,		8,	P|O2,		16,	P|O2,		16,	F|O3,		8,	P|O2,		8,	F|O3,		8,	F|O3,		8,	F|O3,		
		8,	E|O3,		8,	F|O3,		8,	E|O3,		32,	D|O3,		8,	P|O2,		8,	E|O3,		8,	F|O3,		32,	A|O3,		
		8,	P|O2,		8,	E|O3,		8,	D|O3,		8,	E|O3,		8,	D|O3,		32,	C|O3,		8,	P|O2,		16,	P|O2,		
		8,	D|O3,		8,	D|O3,		8,	D|O3,		8,	D|O3,		16,	C|O3,		16,	B|O2,		8,	D|O3,		32,	C|O3,		
		8,	P|O2,		16,	P|O2,		0,  0
	}
};

// Жин-Жин: Снегом стать
const _melody_t melody18 = {
	140, {
		8,	F|O1,		8,	F|O2,		8,	D_|O2,	8,	C_|O2,	8,	C|O2,		8,	C|O2,		8,	C_|O2,	16,	F|O1,		
		8,	P|O1,		8,	P|O1,		8,	P|O1,		8,	P|O1,		8,	C|O2,		8,	C_|O2,	8,	F|O1,		8,	C|O2,		
		8,	C_|O2,	8,	F|O1,		8,	C|O2,		8,	C_|O2,	8,	F_|O1,	8,	C|O2,		16,	C_|O2,	0,  0
	}
};

// Издалека долго
const _melody_t melody19 = {
	90, {
		8,	D_|O1,	8,	G|O1,		8,	A_|O1,	16,	C|O2,		8,	P|O2,		8,	P|O2,		16,	G|O2,		8,	P|O2,		
		8,	P|O2,		16,	F|O2,		8,	P|O2,		8,	P|O2,		8,	P|O2,		8,	F|O1,		8,	G_|O1,	8,	B|O1,		
		16,	C|O2,		8,	P|O2,		8,	P|O2,		16,	F|O2,		8,	P|O2,		8,	P|O2,		16,	D_|O2,	8,	P|O2,		
		8,	P|O2,		8,	P|O2,		8,	D_|O1,	8,	G|O1,		8,	A_|O1,	16,	C|O2,		8,	P|O2,		8,	P|O2,		
		16,	D_|O2,	8,	P|O2,		8,	P|O2,		16,	D|O2,		8,	P|O2,		8,	P|O2,		8,	P|O2,		8,	D|O1,		
		8,	F|O1,		8,	G_|O1,	16,	G|O1,		8,	P|O2,		8,	P|O2,		16,	D|O2,		8,	P|O2,		8,	P|O2,		
		16,	C|O2,		0,  0
	}
};

// Интернационал
const _melody_t melody20 = {
	90, {
		8,	G_|O1,	16,	C_|O2,		8,	C|O2,		8,	D_|O2,		8,	C_|O2,	8,	G_|O1,		8,	F|O1,		16,	A_|O1,		
		16,	F_|O1,	8,	A_|O1,		16,	D_|O2,	8,	C_|O2,		8,	C|O2,		8,	A_|O1,		8,	G_|O1,	8,	F_|O1,		
		16,	F|O1,		8,	G_|O1,		8,	G|O1,		16,	C_|O2,		8,	C|O2,		8,	D_|O2,		8,	C_|O2,	8,	G_|O1,		
		8,	F|O1,		16,	A_|O1,		16,	F_|O1,	8,	A_|O1,		8,	D_|O2,	8,	C_|O2,		16,	C|O2,		8,	D_|O2,		
		8,	F|O2,		16,	F_|O1,		16,	C|O2,		16,	C_|O2,		0,  0
	}
};

// к/ф "Иван Васильевич меняет профессию"
const _melody_t melody21 = {
	180, {
		16,	B|O2,		16,	B|O2,		16,	B|O2,		16,	B|O2,		8,	B|O2,		16,	C|O3,		8,	E|O2,		8,	D_|O2,		
		4,	D_|O2,	4,	E|O2,		4,	F|O2,		4,	F_|O2,	4,	G|O2,		4,	G_|O2,	16,	A|O2,		16,	A|O2,		
		16,	A|O2,		16,	A|O2,		8,	A|O2,		16,	A_|O2,	8,	D_|O2,	16,	E|O2,		8,	P|O2,		16,	E|O3,		
		16,	E|O3,		16,	E|O3,		16,	E|O3,		8,	E|O3,		16,	F|O3,		8,	A|O2,		8,	G_|O2,	4,	A|O2,		
		4,	B|O2,		4,	C|O3,		4,	C_|O3,	4,	D_|O3,	16,	E|O3,		16,	E|O3,		16,	E|O3,		16,	E|O3,		
		32,	E|O3,		32,	E|O3,		0,  0
	}
};

// к/ф "Кин-дза-дза" Мама, мама, что я буду делать
const _melody_t melody22 = {
	90, {
		16,	G|O2,		16,	E|O2,		16,	G|O2,		16,	E|O2,		8,	D|O2,		8,	F|O2,		8,	E|O2,		8,	D|O2,		
		16,	E|O2,		16,	C|O2,		16,	G|O2,		16,	E|O2,		16,	G|O2,		16,	E|O2,		8,	D|O2,		8,	F|O2,		
		8,	E|O2,		8,	D|O2,		16,	C|O2,		8,	P|O2,		8,	P|O2,		0,  0
	}
};

// к/ф 'Берегись автомобиля'
const _melody_t melody23 = {
	160, {
		16,	C_|O2,	32,	P|O2,		8,	C|O2,		16,	C_|O2,	32,	P|O2,		8,	D|O2,		8,	C_|O2,	8,	C_|O2,		
		8,	A|O1,		8,	F_|O1,	8,	C_|O1,	16,	C_|O2,	16,	P|O2,		8,	D|O2,		8,	C_|O2,	8,	C_|O2,		
		8,	F_|O2,	8,	G_|O2,	8,	A|O2,		8,	D|O2,		8,	C_|O2,	8,	C_|O2,	8,	F_|O2,	8,	G_|O2,		
		8,	A|O2,		16,	G_|O2,	8,	P|O2,		8,	F_|O2,	16,	F_|O2,	16,	P|O2,		0,  0
	}
};

// Кан-кан
const _melody_t melody24 = {
	140, {
		8,	B|O0,		16,	E|O1,		8,	P|O2,		8,	F_|O1,	16,	G|O1,		8,	P|O2,		8,	B|O0,		4,	E|O1,		
		4,	P|O2,		8,	F_|O1,	4,	G|O1,		4,	P|O2,		8,	C|O2,		4,	B|O1,		4,	P|O2,		8,	E|O1,		
		4,	G|O1,		4,	P|O2,		8,	B|O1,		32,	A_|O1,	8,	P|O2,		4,	A|O1,		4,	G|O1,		4,	E|O1,		
		4,	D|O1,		32,	E|O1,		16,	P|O2,		8,	E|O2,		4,	P|O2,		4,	D|O2,		8,	B|O1,		4,	P|O2,		
		4,	A|O1,		8,	G|O1,		4,	P|O2,		4,	E|O1,		8,	A|O1,		8,	P|O2,		8,	A|O1,		8,	P|O2,		
		8,	A|O1,		8,	P|O2,		8,	A|O1,		8,	P|O2,		4,	G|O1,		4,	E|O1,		4,	D|O1,		32,	E|O1,		
		4,	P|O2,		0,  0
	}
};

// Капитан, Капитан улыбнитесь
const _melody_t melody25 = {
	250, {
		16,	G|O3,		16,	E|O3,		16,	C|O3,		8,	G|O3,		8,	E|O3,		16,	C|O3,		8,	B|O2,		8,	A|O2,		
		8,	B|O2,		8,	P|O2,		16,	B|O2,		16,	P|O2,		8,	G|O2,		8,	A|O2,		8,	B|O2,		8,	C|O3,		
		8,	D|O3,		8,	E|O3,		16,	F|O3,		8,	E|O3,		8,	D|O3,		32,	A|O3,		16,	P|O2,		8,	A|O3,		
		8,	E|O3,		16,	C|O3,		8,	A|O3,		8,	E|O3,		16,	C|O3,		8,	F|O3,		16,	A|O3,		8,	C|O4,		
		8,	P|O2,		32,	C|O4,		8,	B|O3,		8,	A|O3,		8,	G|O3,		8,	E|O3,		8,	A|O3,		8,	G|O3,		
		8,	F|O3,		8,	A|O3,		8,	P|O2,		4,	A|O2,		4,	B|O2,		16,	C|O3,		16,	P|O2,		0,  0
	}
};

// Карамель - Там-тарарам
const _melody_t melody26 = {
	180, {
		4,	B|O1,		4,	B|O1,		4,	D|O2,		4,	D|O2,		16,	E|O2,		16,	E|O2,		8,	E|O2,		4,	E|O2,		
		4,	E|O2,		8,	F_|O2,	8,	E|O2,		8,	D|O2,		8,	B|O1,		16,	D|O2,		4,	B|O1,		4,	B|O1,		
		8,	D|O2,		16,	E|O2,		16,	E|O2,		16,	E|O2,		4,	E|O2,		8,	F_|O2,	8,	E|O2,		8,	D|O2,		
		0,  0
	}
};

// Катюша
const _melody_t melody27 = {
	90, {
		16,	D|O2,		8,	E|O2,		16,	F|O2,		8,	D|O2,		8,	F|O2,		8,	F|O2,		8,	E|O2,		8,	D|O2,		
		16,	E|O2,		16,	A|O1,		16,	E|O2,		8,	F|O2,		16,	G|O2,		8,	E|O2,		8,	G|O2,		8,	G|O2,		
		8,	F|O2,		8,	E|O2,		32,	D|O2,		16,	A|O2,		16,	D|O3,		16,	C|O3,		8,	D|O3,		8,	C|O3,		
		8,	A_|O2,	8,	A_|O2,	8,	A|O2,		8,	G|O2,		16,	A|O2,		16,	D|O2,		8,	P|O2,		16,	A_|O2,		
		8,	G|O2,		16,	A|O2,		8,	P|O2,		8,	F|O2,		8,	G|O2,		8,	G|O2,		8,	F|O2,		8,	E|O2,		
		16,	D|O2,		16,	P|O2,		0,  0
	}
};

// Кино - Будь осторожен
const _melody_t melody28 = {
	160, {
		8,	C|O2,		16,	G|O2,		8,	G|O2,		8,	G|O2,		8,	C|O2,		8,	C|O2,		8,	C|O2,		8,	C|O2,		
		16,	G|O2,		8,	G|O2,		8,	G|O2,		8,	C|O2,		8,	C|O2,		32,	P|O2,		8,	D_|O2,	8,	D_|O2,		
		8,	C|O2,		16,	G|O1,		8,	G|O1,		8,	G|O1,		16,	D_|O2,	8,	D_|O2,	16,	C|O2,		32,	P|O2,		
		8,	D_|O2,	8,	D_|O2,	8,	C|O2,		16,	C|O2,		8,	C|O2,		16,	C|O2,		8,	C|O2,		8,	A|O1,		
		8,	C|O2,		16,	G|O1,		32,	P|O2,		0,  0
	}
};

// Кино - Восьмиклассница
const _melody_t melody29 = {
	210, {
		16,	G_|O1,	16,	G_|O1,	8,	P|O2,		8,	A_|O1,	8,	G_|O1,	8,	G|O1,		16,	F|O1,		8,	P|O2,		
		8,	P|O2,		8,	P|O2,		8,	P|O2,		8,	D_|O1,	8,	F|O1,		8,	G|O1,		8,	P|O2,		8,	G|O1,		
		8,	G|O1,		8,	P|O2,		8,	G|O1,		8,	F|O1,		8,	G|O1,		16,	D_|O1,	8,	P|O2,		8,	P|O2,		
		16,	C|O1,		8,	P|O2,		8,	P|O2,		16,	G_|O1,	16,	G_|O1,	8,	P|O2,		8,	A_|O1,	8,	G_|O1,		
		8,	G|O1,		16,	F|O1,		8,	P|O2,		8,	P|O2,		8,	P|O2,		8,	P|O2,		8,	D_|O1,	8,	F|O1,		
		8,	G|O1,		8,	P|O2,		8,	G|O1,		16,	G|O1,		0,  0
	}
};

// Кино - Группа крови
const _melody_t melody30 = {
	160, {
		16,	A|O2,		16,	G_|O2,	8,	F_|O2,	8,	F_|O2,	16,	P|O2,		8,	C_|O3,	8,	C_|O3,	8,	C_|O3,		
		16,	F_|O2,	16,	F_|O2,	8,	F_|O2,	8,	F_|O2,	8,	G_|O2,	16,	A|O2,		8,	G_|O2,	8,	G_|O2,		
		16,	P|O2,		8,	C_|O3,	8,	C_|O3,	8,	C_|O3,	8,	G_|O2,	32,	P|O2,		8,	G_|O2,	8,	G_|O2,		
		16,	A|O2,		8,	A|O2,		8,	F_|O2,	8,	A|O2,		16,	A|O2,		8,	A|O2,		16,	F_|O2,	32,	P|O2,		
		8,	G_|O2,	8,	A|O2,		32,	G_|O2,	32,	E|O2,		32,	C_|O2,	0,  0
	}
};

// Кино - Звезда по имени солнце
const _melody_t melody31 = {
	140, {
		8,	C|O3,		8,	C|O3,		16,	A|O2,		32,	P|O2,		8,	E|O2,		8,	E|O2,		16,	E|O2,		32,	P|O2,		
		8,	E|O2,		8,	E|O2,		8,	G|O2,		16,	G|O2,		8,	E|O2,		16,	G|O2,		16,	A|O2,		16,	E|O2,		
		32,	P|O2,		8,	E|O2,		8,	E|O2,		8,	D|O2,		16,	D|O2,		8,	C|O2,		8,	D|O2,		8,	D|O2,		
		16,	E|O2,		32,	D|O2,		32,	P|O2,		8,	D|O2,		16,	D|O2,		8,	D|O2,		8,	D|O2,		8,	D|O2,		
		16,	E|O2,		32,	D|O2,		32,	P|O2,		0,  0
	}
};

// Кино - Кончится лето
const _melody_t melody32 = {
	240, {
		8,	B|O1,		8,	E|O2,		16,	G|O2,		16,	G|O2,		16,	G|O2,		16,	G|O2,		16,	G|O2,		8,	G|O2,		
		8,	F_|O2,	8,	E|O2,		16,	B|O1,		8,	D|O2,		16,	F_|O2,	16,	F_|O2,	16,	F_|O2,	16,	F_|O2,		
		16,	F_|O2,	8,	F_|O2,	8,	F_|O2,	8,	A|O2,		16,	G|O2,	  8,	B|O1,		16,	D|O2,		16,	F_|O2,		
		16,	F_|O2,	16,	F_|O2,	16,	F_|O2,	8,	F_|O2,	8,	F_|O2,	8,	A|O2,		16,	G|O2,		8,	B|O1,		
		16,	E|O2,		16,	E|O2,		16,	E|O2,		16,	E|O2,		16,	E|O2,		8,	G|O2,		8,	F_|O2,	8,	E|O2,		
		8,	B|O1,		0,  0
	}
};

// Кино - Красно жёлтые дни
const _melody_t melody33 = {
	140, {
		8,	F_|O1,	8,	B|O1,		8,	F_|O1,	8,	B|O1,		8,	F_|O1,	8,	D|O2,		8,	F_|O1,	8,	C_|O2,		
		8,	F_|O1,	16,	B|O1,		32,	P|O2,		8,	A|O1,		8,	D|O2,		8,	A|O1,		8,	D|O2,		8,	A|O1,		
		8,	F_|O2,	8,	A|O1,		8,	E|O2,		8,	A|O1,		16,	D|O2,		32,	P|O2,		8,	D|O2,		8,	G|O2,		
		8,	D|O2,		8,	G|O2,		8,	D|O2,		8,	B|O2,		8,	D|O2,		8,	A|O2,		8,	D|O2,		16,	G|O2,		
		32,	P|O2,		8,	A|O1,		8,	D|O2,		8,	A|O1,		16,	D|O2,		8,	P|O2,		8,	D|O2,		8,	D|O2,		
		32,	D|O2,		32,	P|O2,		0,  0
	}
};

// Лада
const _melody_t melody34 = {
	120, {
		4,	G|O3,		4,	P|O2,		4,	G|O3,		4,	P|O2,		4,	G|O3,		4,	P|O2,		4,	G|O3,		4,	P|O2,		
		16,	G|O3,		16,	G|O3,		16,	A_|O3,		8,	P|O2,		16,	G|O3,		8,	P|O2,		16,	P|O2,		4,	G_|O3,		
		4,	P|O2,		4,	G_|O3,		4,	P|O2,		4,	G_|O3,		4,	P|O2,		4,	G_|O3,		4,	P|O2,		16,	G_|O3,		
		16,	G_|O3,		16,	B|O3,		8,	P|O2,		16,	G_|O3,		8,	P|O2,		16,	P|O2,		4,	G|O3,		4,	P|O2,		
		4,	G|O3,		4,	P|O2,		4,	G|O3,		4,	P|O2,		4,	G|O3,		4,	P|O2,		16,	G|O3,		16,	G|O3,		
		16,	A_|O3,		8,	P|O2,		16,	G|O3,		8,	P|O2,		16,	P|O2,		16,	A_|O3,		16,	A_|O3,		32,	P|O2,		
		
	}
};

// Ласковый май - Белые розы
const _melody_t melody35 = {
	120, {
		8,	B|O1,		8,	B|O1,		8,	B|O1,		16,	B|O1,		16,	F_|O1,		8,	P|O2,		8,	B|O1,		8,	B|O1,		
		8,	B|O1,		16,	B|O1,		16,	F_|O1,		8,	P|O2,		16,	B|O1,		16,	G|O1,		8,	F_|O1,		8,	G|O1,		
		8,	F_|O1,		16,	G|O1,		8,	P|O2,		8,	P|O2,		8,	P|O2,		8,	A|O1,		8,	A|O1,		8,	A|O1,		
		16,	A|O1,		16,	E|O1,		8,	P|O2,		8,	A|O1,		8,	A|O1,		8,	A|O1,		16,	A|O1,		16,	E|O1,		
		8,	P|O2,		16,	A|O1,		16,	F|O1,		8,	E|O1,		8,	F|O1,		8,	E|O1,		16,	F|O1,		
	}
};

// Лебединое озеро
const _melody_t melody36 = {
	120, {
		16,	D|O3,		8,	G|O2,		8,	A|O2,		8,	A_|O2,		8,	C|O3,		16,	D|O3,		8,	A_|O2,		16,	D|O3,		
		8,	A_|O2,		16,	D|O3,		8,	G|O2,		8,	A_|O2,		8,	G|O2,		8,	D_|O2,		8,	A_|O2,		16,	G|O2,		
		8,	C|O3,		8,	A_|O2,		8,	A|O2,		16,	D|O3,		8,	G|O2,		8,	A|O2,		8,	A_|O2,		8,	C|O3,		
		16,	D|O3,		8,	A_|O2,		16,	D|O3,		8,	A_|O2,		16,	D|O3,		8,	G|O2,		8,	A_|O2,		8,	G|O2,		
		8,	D_|O2,		8,	A_|O2,		16,	G|O2,		
	}
};

// Лезгинка
const _melody_t melody37 = {
	120, {
		8,	A|O1,		4,	C|O2,		8,	E|O2,		8,	F|O2,		8,	E|O2,		8,	C|O2,		8,	A|O1,		4,	P|O2,		
		4,	E|O2,		4,	E|O2,		4,	P|O2,		4,	E|O2,		8,	D|O2,		8,	C|O2,		8,	D|O2,		8,	B|O1,		
		8,	G|O1,		8,	P|O2,		8,	G|O1,		4,	B|O1,		8,	D|O2,		8,	E|O2,		8,	D|O2,		8,	B|O1,		
		8,	G|O1,		4,	P|O2,		4,	D|O2,		4,	D|O2,		4,	P|O2,		4,	D|O2,		8,	C|O2,		8,	B|O1,		
		16,	A|O1,		8,	P|O2,		
	}
};

// Ленин всегда живой
const _melody_t melody38 = {
	120, {
		16,	A|O1,		8,	P|O2,		16,	A|O1,		8,	P|O2,		8,	P|O2,		8,	G|O1,		8,	P|O2,		8,	A_|O1,		
		8,	P|O2,		8,	A|O1,		8,	P|O2,		16,	G|O1,		8,	P|O2,		8,	P|O2,		16,	F|O1,		8,	P|O2,		
		16,	F|O1,		8,	P|O2,		8,	P|O2,		8,	E|O1,		8,	P|O2,		8,	G|O1,		8,	P|O2,		8,	F|O1,		
		8,	P|O2,		16,	E|O1,		
	}
};

// Леприконсы - Хали гали Паратрупер
const _melody_t melody39 = {
	120, {
		8,	F_|O1,		16,	B|O1,		8,	P|O2,		8,	F_|O1,		16,	C_|O2,		8,	P|O2,		8,	F_|O1,		16,	D|O2,		
		8,	P|O2,		8,	D|O2,		8,	D|O2,		8,	C_|O2,		8,	B|O1,		8,	A|O1,		8,	B|O1,		8,	P|O2,		
		16,	F_|O2,		8,	P|O2,		8,	E|O2,		8,	D|O2,		8,	B|O1,		8,	E|O2,		8,	D|O2,		8,	B|O1,		
		16,	P|O2,		8,	F_|O1,		16,	B|O1,		8,	P|O2,		8,	F_|O1,		16,	C_|O2,		8,	P|O2,		8,	F_|O1,		
		16,	D|O2,		8,	P|O2,		8,	D|O2,		8,	D|O2,		8,	C_|O2,		8,	B|O1,		8,	A|O1,		8,	B|O1,		
		8,	P|O2,		32,	A|O2,		8,	F_|O2,		8,	E|O2,		8,	D|O2,		8,	B|O1,		16,	P|O2,		
	}
};


///////////////////////////////////////////////////////////////////////////////
const _melody_t *melodies[] = {
  &melody00, &melody01, &melody02, &melody03, &melody04, &melody05, &melody06, &melody07, &melody08, &melody09,
  &melody10, &melody11, &melody12, &melody13, &melody14, &melody15, &melody16, &melody17, &melody18, &melody19,
  &melody20, &melody21, &melody22, &melody23, &melody24, &melody25, &melody26, &melody27, &melody28, &melody29,
  &melody30, &melody31, &melody32, &melody33, &melody34, &melody35, &melody36, &melody37, &melody38, &melody39,
};
